Revit 2027 API
BuiltInFailures.PointFailures.CantChangeParamRotate Property
 Can't rotate Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantChangeParamRotate { get; }
Public Shared ReadOnly Property CantChangeParamRotate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantChangeParamRotate {
	FailureDefinitionId^ get ();
}
static member CantChangeParamRotate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace